# Link Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentEntryPoint..::..Link Method
DocumentEntryPoint Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Link(String, DWFImportOptions) | Links Markups in a DWF file into the project document.  (Inherited from Document.) |
| Link(String, ImportOptions3DM, View) | Links a 3DM file into the project document.  (Inherited from Document.) |
| Link(String, OBJImportOptions, View) | Links an OBJ file into the project document.  (Inherited from Document.) |
| Link(String, SATImportOptions, View) | Links an SAT file into the project document.  (Inherited from Document.) |
| Link(String, SKPImportOptions, View) | Links a SKP file into the project document.  (Inherited from Document.) |
| Link(String, STLImportOptions, View) | Links an STL file into the project document.  (Inherited from Document.) |
| Link(String, DGNImportOptions, View, ElementId%) | Links a DGN file into the project document.  (Inherited from Document.) |
| Link(String, DWGImportOptions, View, ElementId%) | Links a DWG or DXF file into the project document.  (Inherited from Document.) |

# See Also
DocumentEntryPoint Class
DocumentEntryPoint Members
Autodesk.Revit.DB.Macros Namespace